/*******************************************************
 * LCD1602(并行8位数据接口)
 *
 *******************************************************/
#include "lcd1602.h"

int main(void)
{
    lcd1602_init();
    lcd1602_write_cmd(0x80);        /* % 给出地址指针，第一行的第1个字符位 */
    lcd1602_write_dat('y');         /* % 写入数据 */
    lcd1602_write_cmd(0x80+5);      /* % 给出地址指针,第一行第6个字符位 */
    lcd1602_write_dat('0');         /* % 显示0 */
    lcd1602_write_dat(0x30);        /* % 显示0 */
    lcd1602_write_cmd(0x80+0x40);   /* % 给出地址指针，第二行的第1个字符 */
    lcd1602_write_dat(0x38);        /* % 显示数字 8 */
    lcd1602_string_set(0,0,"hello,");
	lcd1602_string_set(4,1,"world!");
}

/*******************************************************
 * 函数名称: lcd1602_write_cmd
 * 输入参数: cmd->发送的命令
 * 输出参数: <-无
 *
 *******************************************************/
void lcd1602_write_cmd(uint8_t cmd)
{   
    RS = 0;                     /* % RS为低电平表示要写入的是命令(command) */
    RW = 0;                     /* % RW为低电平表示是写信号 */
    EN = 0;                     /* % EN为使能信号，开始为低电平 */
    P0 = cmd;                   /* % 先送入命令(command) */
    delay_ms(2);                /* % 稍作延时，等待数据稳定 */
    EN = 1;                     /* % 然后在把使能信号拉高，数据开始写入LCD1602中 */
    delay_ms(2);                /* % 稍作延时，等待数据写入完成 */
    EN = 0;                     /* % 之后再把使能信号拉低 */
    delay_ms(2);                /* % 稍作延时 */
}

/*******************************************************
 * 函数名称: lcd1602_write_dat
 * 输入参数: cmd->发送的数据
 * 输出参数: <-无
 *
 *******************************************************/
void lcd1602_write_dat(uint8_t dat)
{   
    RS = 1;                     /* % RS为低高电平表示要写入的是数据 */
    RW = 0;                     /* % RW为低电平表示是写信号 */
    EN = 0;                     /* % EN为使能信号，开始为低电平 */
    P0 = dat;                   /* % 先送人(data数据) */
    delay_ms(2);                /* % 稍作延时，等待数据稳定 */
    EN = 1;                     /* % 然后在把使能信号拉高，数据开始写入LCD1602中 */
    delay_ms(2);                /* % 稍作延时，等待数据写入完成 */
    EN = 0;                     /* % 之后再把使能信号拉低 */
    delay_ms(2);                /* % 稍作延时 */
}

/*******************************************************
 * 函数名称: lcd1602_init
 * 输入参数: ->无
 * 输出参数: <-无
 *
 *******************************************************/
void lcd1602_init(void)
{
    lcd1602_write_cmd(0x38);    /* % 显示模式设置 */
    delay_ms(5);
    lcd1602_write_cmd(0x0f);    /* % 光标显示[0x0E,光标不闪][0x0C，光标不显示] */
    delay_ms(5);
    lcd1602_write_cmd(0x0c);    /* % 显示开及光标设置 */
    delay_ms(5);
    lcd1602_write_cmd(0x06);    /* % 显示光标移动设置(地址指针自动加1) */
    delay_ms(5);
    lcd1602_write_cmd(0x01);    /* % 显示清屏 */
    delay_ms(5);
}

/*******************************************************
 * 函数名称: lcd1602_clear_all
 * 输入参数: ->无
 * 输出参数: <-无
 *
 *******************************************************/
void lcd1602_clear_all(void)
{
    lcd1602_write_cmd(0x01);
    lcd1602_write_cmd(0x80);
}

/*******************************************************
 * 函数名称: lcd1602_busy
 * 输入参数: ->无
 * 输出参数: <-(0x80_忙碌状态, 否则为空闲状态)
 *
 *******************************************************/
/* % LCD1602 忙碌检测 */
/* % 根据规定，RS为低电平，RW为高电平时，可以读状态 */
uint8_t lcd1602_busy(void)
{
    uint8_t result;
    RS = 0;                     /* % command */
    RW = 1;                     /* % read_status */
    EN = 1;                     /* % 使能控制 */
    /* % 空操作四个机器周期，给硬件反应时间 */
    _nop_(); _nop_(); _nop_(); _nop_();
    /* % LCD的D0－D7中，(D7＝1为忙碌，D7＝0为空闲) */
    result = P0 & 0x80;    
    EN ＝ 0;
    return result;
}

/*******************************************************
 * 函数名称: lcd1602_char_set
 * 输入参数: p_x    ->列坐标
 * 输入参数: p_y    ->行坐标
 * 输入参数: p_char ->要写入的字符
 * 输出参数: <-无
 *
 *******************************************************/
/* % set a character at the given position */
/* % 在指定坐标设置字符（p_x=0~15, p_y=0~1） */
void lcd1602_char_set(uint8_t p_x, uint8_t p_y, uint8_t p_char)
{
    uint8_t t_cmd = 0x80;
    p_x &= 0x0f;
    p_y &= 0x01;
    t_cmd |= p_x;
    if (p_y)
    {
        t_cmd |= 0x40;
    }
    lcd1602_write_cmd(t_cmd);
    lcd1602_write_dat(p_char);
}

/*******************************************************
 * 函数名称: lcd1602_string_set
 * 输入参数: p_x        ->列坐标
 * 输入参数: p_y        ->行坐标
 * 输入参数: *p_string  ->要写入的字符串首地址
 * 输出参数: <-无
 *
 *******************************************************/
/* % write a string from the given position */
/* % 从指定位置开始设置字符串（p_x=0~15，p_y=0~1，p_string必须是以0结尾的字符串） */
void lcd1602_string_set(uint8_t p_x, uint8_t p_y, const uint8_t *p_string)
{
    uint8_t t_x, t_y;
    p_x &= 0x0f;
    p_y &= 0x01;
    for (t_y = p_y; t_y < 2; t_y++)
    {
        for (t_x = p_x; t_x < 16 && (*p_string) != 0; t_x++)
        {
            lcd1602_char_set(t_x, t_y, *(p_string++));
        }
    }
}


/*******************************************************
 * 函数名称: delay_ms
 * 输入参数: ->无
 * 输出参数: <-无
 *
 *******************************************************/
/* % 毫秒级延时子程序，  (8051, 12MHZ晶振) */
void delay_ms(uint16_t z)
{
    uint16_t x,y;
    for(x = z; x > 0; x--)
        for(y = 110; y > 0; y--);
}


