############################################################
### % 动态任务创建
############################################################
#include "FreeRTOS.h"
#include "task.h"
% 创建一个新的任务，每个任务需要RAM来保存任务状态(任务控制块+任务栈)，
% 此接口采用动态分配内存资源的方法。
BaseType_t xTaskCreat(
        TaskFunction_t pvTaskCode,      //任务实现函数指针(函数名)
        const char *const pcName,       //任务名称
        unsigned short usStackDepth,    //任务堆栈大小，单位为“字”
        void *pvParameters,             //任务传入参数
        UBaseType uxPriority,           //任务优先级
        TaskHandle_t *pxCreatedTask);   //任务句柄
% 任务创建返回值
pdPASS                                  % 创建成功
errCOULD_NOT_ALLOCATE_REQUIRED_MEMORY   % 堆空间不足，创建失败

% 任务创建注意事项      
% ConfigSUPPORT_DYNAMIC_ALLOCATION 必需为“1”  



############################################################
### % 静态任务创建
############################################################
#include "FreeRTOS.h"
#include "task.h"
% 静态创建一个新任务，第个任务都需要RAM来保存任务状态(任务控制块+任务栈)
% 此接口采用静态分配内存资源
TaskHandle_t TaskCreateStatic(
    TaskTunction_t pvTaskCode,  //任务实现函数指针(函数名)
    const char * const pcName,  //任务名称(字符串)
    uint32_t ulStackDepth,      //任务栈大小，单位为字
    void *pvParameters,         //任务传入参数
    UBaseType_t uxPriority,     //任务优先级
    StackType_t * const puxStackBuffer,// 任务堆栈指针
    StackType_t * cosnt pxTaskBuffer); // 任务控制块指针

NULL        // 创建失败
!NULL       // 返回任务句柄

% 注意事项
configSUPPORT_STATIC_ALLOCATION 必须为“1”


############################################################
### % 任务控制块 TCB_t
############################################################
*pxTopOfStack           //任务堆栈栈顶
xStateListItem          //状态列表项
xEventListItem          //事件列表项
uxPriority              //任务优先级
*pxStack                //任务栈起始地址
pcTaskName[]            //任务名称
*pxEndOfStack           //任务堆栈栈底


############################################################
### % 任务动态创建流程 xTaskCreate()
############################################################
1 分配任务控制块内存空间 + 分配任务堆栈空间
2 初始化任务控制块 + 初始化任务堆栈
3 添加任务到就绪列表中



############################################################
### % 任务删除流程 vTaskDelete()
############################################################
1 从就绪表中删除
2 从事件表中删除 
3 释放任务控制块 + 释放任务堆栈内存
4 开始任务调度



############################################################
### % 任务挂起流程 vTaskSuspend()
############################################################
1 从就绪表中删除
2 从事件表中删除
3 添加任务到挂起列表中
3 开始任务调度


############################################################
### % 任务恢复流程 vTaskResume()
############################################################
1 从挂起列表中删除
2 添加任务到就绪列表中
3 开始任务调度